username = ''
passwd = ''
chrome_path = ''
site = 'zh.wikipedia.org'
csd_cat = 'Category:快速删除候选'
pattern = r'\{\{\s*(db|[Dd]|sd|csd|speedy|delete|速刪|速删|快刪|快删|hang\s*on)(\|.+)*\}\}'

g1 = "[[WP:G1|G1]]：没有实际内容的页面"
G1 = empty = g1
g2 = "[[WP:G2|G2]]：测试页面"
G2 = g2
g3 = "[[WP:G3|G3]]：纯粹[[WP:VAN|破坏]]，包括但不限于明显的[[WP:HOAX|恶作剧]]、错误信息、[[WP:PA|人身攻击]]等"
G3 = g3
g5 = "[[WP:G5|G5]]：曾经根据[[WP:AFD|頁面存廢討論]]、[[WP:CV|侵權審核]]或[[WP:FFD|檔案存廢討論]]結果删除後又重新" \
     "創建的内容，而有關內容與已刪除版本""相同或非常相似""，無論標題是否相同"
G5 = g5
g8 = "[[WP:G8|G8]]：管理员因技术原因删除页面"
G8 = g8
g10 = "[[WP:G10|G10]]：原作者清空頁面或提出刪除，且貢獻者只有一人（对页面内容无实际修改的除外；提請須出於善意" \
      "，及附有合理原因）"
G10 = g10
g11 = "[[WP:G11|G11]]：明顯的[[WP:SOAP|廣告宣傳]]頁面，或只有相关人物或團體的聯繫方法的页面"
G11 = spam = g11
g12 = "[[WP:G12|G12]]：未列明來源''且''語調負面的[[WP:BLP|生者傳記]]"
G12 = bio = g12
g13 = "[[WP:G13|G13]]：明顯、拙劣的機器翻譯"
G13 = g13
g14 = "[[WP:G14|G14]]：超過兩周沒有進行任何翻譯的非[[現代標準漢語]]页面"
G14 = nc = g14
g15 = "[[WP:G15|G15]]：孤立页面，比如没有主页面的[[WP:TALK|讨论页]]、指向空页面的[[WP:R|重定向]]等"
G15 = g15
g16 = "[[WP:G16|G16]]：因為主頁面[[WP:侵权|侵权]]而創建的臨時頁面仍然侵權"
G16 = g16
a1 = "[[WP:A1|A1]]：条目的内容笼统，或甚至根本没有提及条目主体，使条目不能用以区分其他事物"
A1 = context = a1
a2 = "[[WP:A2|A2]]：內容只包括外部链接、参见、图书参考、分类、模板、跨语言链接的条目（[[WP:D|消歧義頁]]、" \
     "[[WP:R|重定向]]、[[WP:SRD|軟重定向]]除外）"
A2 = a2
a3 = "[[WP:A3|A3]]：複製自其他[[T:Wikimedia project|中文维基项目]]，或是與其他中文维基项目內容相同的文章"
A3 = a3
a5 = "[[WP:A5|A5]]：條目建立時之內容即與其他現有條目內容''完全''相同，且名稱不適合做為其他條目之[[WP:R|重定向]]" \
     "（不包括拆分、合併、重組後產生之條目，或是引用相關資料之條目）"
A5 = a5
a6 = "[[WP:A6|A6]]：复制自其他维基百科语言版本，且完全没有翻译"
A6 = a6
r2 = "[[WP:R2|R2]]：跨[[H:NS|名字空间]]的[[WP:R|重定向]]"
R2 = r2
r3 = "[[WP:R3|R3]]：格式錯誤，或明显笔误的[[WP:R|重定向]]"
R3 = wr =r3
r5 = "[[WP:R5|R5]]：指向本身或循环的[[WP:R|重定向]]"
R5 = r5
r6 = "[[WP:R6|R6]]：移動檔案而產生的[[WP:R|重定向]]，且頁面標題不符合[[WP:FNC|檔案名稱指引]]"
R6 = r6
r7 = "[[WP:R7|R7]]：明顯與導向目標所涵蓋的主題無關或比導向目標所涵蓋的主題更廣泛的[[WP:R|重定向]]"
R7 = r7
f1 = "[[WP:F1|F1]]：重复的檔案（完全相同或缩小），而且不再被條目使用"
F1 = f1
f3 = "[[WP:F3|F3]]：所有在提報後超過5天仍[[:CAT:來源不明檔案|來源不明的檔案]]"
F3 = f3
f4 = "[[WP:F4|F4]]：所有在提報後超過5天仍[[:CAT:未知版权的档案|未知版權或版權無法被查證的檔案]]"
F4 = f4
f5 = "[[WP:F5|F5]]：被高解析度或[[SVG]]檔案取代的圖片"
F5 = f5
f6 = "[[WP:F6|F6]]：沒有被條目使用的[[WP:合理使用|非自由版权]]檔案会在提交5日后刪除"
F6 = f6
f7 = "[[WP:F7|F7]]：与[[維基共享資源]]檔案重复的檔案"
F7 = f7
f8 = "[[WP:F8|F8]]：明顯侵權之檔案會在提報5日後刪除"
F8 = f8
o1 = "[[WP:O1|O1]]：用户请求删除自己的[[H:用户页|用户页]]或其子页面"
O1 = o1
o4 = "[[WP:O4|O4]]：空的分类（没有条目也没有子分类）"
O4 = o4
o7 = "[[WP:O7|O7]]：廢棄草稿"
O7 = o7
